#!/bin/bash

# Извличаме днешното число
DAY=$(date +%d)

# Проверяваме дали числото е 08
if [ "$DAY" == "08" ]; then
    echo "да"
else
    echo "не"
fi


създаваме файл -
    > script.sh
    отваряме го с - vim script.sh
    поставяме скрипта вътре

Зада затворим vim файлт - esc, shift + :, wq + enter

Когато искаме просто да прочетем съдържанието на самия скрипт - cat sript.sh

Зада изпълним самия скрипт с командата - bash script.sh




По-подробно обяснение 


Ако имаш файл script.sh със съдържание като нашия Bash скрипт, ето какво ще се случи при изпълнението на двете команди:

cat script.sh

Тази команда просто ще изведе съдържанието на файла script.sh в терминала, но няма да го изпълни.
Например, ще видиш нещо като това в терминала:

#!/bin/bash

# Извличаме днешното число
DAY=$(date +%d)

# Проверяваме дали числото е 08
if [ "$DAY" == "08" ] ; then
    echo "да"
else
    echo "не"
fi


bash script.sh - Тази команда ще изпълни скрипта с помощта на bash, независимо дали той има изпълним (chmod +x) флаг или не.
Ако днешният ден е 8-ми, ще покаже:

да
В противен случай ще покаже:
не

Ако искаш да го изпълниш директно без bash script.sh, трябва първо да му дадеш права за изпълнение с:
chmod +x script.sh

След което можеш да го стартираш с:
./script.sh